In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv(r"C:\Users\Gitanshu\Downloads\Fortune_10.csv")
df.head()

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,NaN
3,4,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,NaN
4,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,NaN

In [3]:
df.shape

(10, 8)

In [4]:
df.isnull().sum()

ID           0
Name         0
Industry     0
Inception    0
Revenue      2
Expenses     0
Profit       0
Growth       4
dtype: int64

In [5]:
df.isnull().sum().sum()

6

In [6]:
df = pd.read_csv(r"C:\Users\Gitanshu\Downloads\Fortune_10.csv")
df.head()

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,NaN
3,4,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,NaN
4,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,NaN

In [7]:
df.notnull().sum().sum()

74

In [8]:
sr = pd.Series([1,2,3,np.nan,4,np.NaN])
sr

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    NaN
dtype: float64

In [9]:
sr.isnull().sum()

2

In [10]:
data = pd.read_csv(r"C:\Users\Gitanshu\Downloads\Fortune_5.csv")
data

   ID       Name           Companies     Profit Growth
0   1    Lamtone         IT Services  5274553.0    30%
1   2  Stripfind  Financial Services        NaN    20%
2   3        NaN              Health  3005820.0     7%
3   4        NaN         IT Services  6597557.0    NaN
4   5       Mark           Insurance  3138627.0    26%

In [11]:
data.dropna(axis=1) #drops columns

   ID           Companies
0   1         IT Services
1   2  Financial Services
2   3              Health
3   4         IT Services
4   5           Insurance

In [12]:
data.dropna(how='any')

   ID     Name    Companies     Profit Growth
0   1  Lamtone  IT Services  5274553.0    30%
4   5     Mark    Insurance  3138627.0    26%

In [13]:
data.dropna(how='all')

   ID       Name           Companies     Profit Growth
0   1    Lamtone         IT Services  5274553.0    30%
1   2  Stripfind  Financial Services        NaN    20%
2   3        NaN              Health  3005820.0     7%
3   4        NaN         IT Services  6597557.0    NaN
4   5       Mark           Insurance  3138627.0    26%

In [14]:
data.dropna(thresh=4)

   ID       Name           Companies     Profit Growth
0   1    Lamtone         IT Services  5274553.0    30%
1   2  Stripfind  Financial Services        NaN    20%
2   3        NaN              Health  3005820.0     7%
4   5       Mark           Insurance  3138627.0    26%

In [18]:
data.dropna(subset = ['Name'])

   ID     Name    Companies     Profit Growth
0   1  Lamtone  IT Services  5274553.0    30%
4   5     Mark    Insurance  3138627.0    26%

In [19]:
data.dropna(inplace = True)

In [20]:
data

   ID     Name    Companies     Profit Growth
0   1  Lamtone  IT Services  5274553.0    30%
4   5     Mark    Insurance  3138627.0    26%